# Trabalhando com  (dados faltantes)

In [10]:
import pandas as pd
import numpy as np

data = {
    "nome":["Téo", "Nah", "Lah", "Mah", "Jo"],
    "idade":[31,32,34,12,np.nan],
    "renda":[np.nan,3245,357,12432,np.nan],
}

df = pd.DataFrame(data)
df

  nome  idade    renda
0  Téo   31.0      NaN
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0
4   Jo    NaN      NaN

In [11]:
# isna retorna true ou false, somando os trues (valor 1) você verifica a quantidade de nan
df["idade"].isna().sum()

np.int64(1)

In [12]:
# Vendo em todas as tabelas no dataframe
df.isna().sum()

nome     0
idade    1
renda    2
dtype: int64

In [13]:
# Descobrindo a proporção de valores nulos nas colunas
df.isna().mean()

nome     0.0
idade    0.2
renda    0.4
dtype: float64

In [16]:
# Preenchendo os NAs
df.fillna({
    "idade": df["idade"].mean(),
    "renda": df["renda"].mean(),
})

  nome  idade         renda
0  Téo  31.00   5344.666667
1  Nah  32.00   3245.000000
2  Lah  34.00    357.000000
3  Mah  12.00  12432.000000
4   Jo  27.25   5344.666667

In [23]:
# Drop NA (remove a linha onde tem NA)
df.dropna()

  nome  idade    renda
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0

In [24]:
# Remove se as duas linhas estiverem vazias
df.dropna(subset=["idade", "renda"], how="all")

  nome  idade    renda
0  Téo   31.0      NaN
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0

In [25]:
# Remove se uma das duas linhas estiverem vazias
df.dropna(subset=["idade", "renda"], how="any")

  nome  idade    renda
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0

In [28]:
# Dropa colunas com NA
df.dropna(axis=1, how="any")

  nome
0  Téo
1  Nah
2  Lah
3  Mah
4   Jo